MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_cordic.h
/**
  ******************************************************************************
  * @file    stm32c5xx_ll_cordic.h
  * @brief   Header file of CORDIC LL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32C5XX_LL_CORDIC_H
#define STM32C5XX_LL_CORDIC_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32c5xx.h"

/** @addtogroup STM32C5xx_LL_Driver
  * @{
  */
#if defined(CORDIC)

/** @defgroup CORDIC_LL CORDIC
  * @{
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup CORDIC_LL_Exported_Constants LL CORDIC Constants
  * @{
  */

/** @defgroup CORDIC_LL_EC_GET_FLAG Get Flags Defines
  * @brief    Flag defines that can be used with the LL_CORDIC_READ_REG function.
  * @{
  */
#define LL_CORDIC_FLAG_RRDY CORDIC_CSR_RRDY
/**
  * @}
  */

/** @defgroup CORDIC_LL_EC_WRITE_FLAG DMA WRITE Flags Defines
  * @brief    Flag defines whether DMA write is enabled.
  * @{
  */
#define LL_CORDIC_FLAG_DMAWEN CORDIC_CSR_DMAWEN
/**
  * @}
  */

/** @defgroup CORDIC_LL_READ_GET_FLAG DMA READ Flags Defines
  * @brief    Flag defines whether DMA read is enabled.
  * @{
  */
#define LL_CORDIC_FLAG_DMAREN CORDIC_CSR_DMAREN
/**
  * @}
  */

/** @defgroup CORDIC_LL_EC_IT IT Defines
  * @brief    IT defines that can be used with LL_CORDIC_READ_REG and LL_CORDIC_WriteReg functions.
  * @{
  */
#define LL_CORDIC_IT_IEN CORDIC_CSR_IEN /*!< Result Ready interrupt enable */
/**
  * @}
  */

/** @defgroup CORDIC_LL_EC_FUNCTION FUNCTION
  * @{
  */
#define LL_CORDIC_FUNCTION_COSINE      (0x00000000U)                                       /*!< Cosine                */
#define LL_CORDIC_FUNCTION_SINE        ((uint32_t)(CORDIC_CSR_FUNC_0))                     /*!< Sine                  */
#define LL_CORDIC_FUNCTION_PHASE       ((uint32_t)(CORDIC_CSR_FUNC_1))                     /*!< Phase                 */
#define LL_CORDIC_FUNCTION_MODULUS     ((uint32_t)(CORDIC_CSR_FUNC_1 | CORDIC_CSR_FUNC_0)) /*!< Modulus               */
#define LL_CORDIC_FUNCTION_ARCTANGENT  ((uint32_t)(CORDIC_CSR_FUNC_2))                     /*!< Arctangent            */
#define LL_CORDIC_FUNCTION_HCOSINE     ((uint32_t)(CORDIC_CSR_FUNC_2 | CORDIC_CSR_FUNC_0)) /*!< Hyperbolic Cosine     */
#define LL_CORDIC_FUNCTION_HSINE       ((uint32_t)(CORDIC_CSR_FUNC_2 | CORDIC_CSR_FUNC_1)) /*!< Hyperbolic Sine       */
#define LL_CORDIC_FUNCTION_HARCTANGENT ((uint32_t)(CORDIC_CSR_FUNC_2 | CORDIC_CSR_FUNC_1 \
                                                   | CORDIC_CSR_FUNC_0))                   /*!< Hyperbolic Arctangent */
#define LL_CORDIC_FUNCTION_NATURALLOG  ((uint32_t)(CORDIC_CSR_FUNC_3))                     /*!< Natural Logarithm     */
#define LL_CORDIC_FUNCTION_SQUAREROOT  ((uint32_t)(CORDIC_CSR_FUNC_3 | CORDIC_CSR_FUNC_0)) /*!< Square Root           */
/**
  * @}
  */

/** @defgroup CORDIC_LL_EC_PRECISION PRECISION
  * @{
  */
#define LL_CORDIC_PRECISION_1_CYCLE  ((uint32_t)(CORDIC_CSR_PRECISION_0))                            /*!< 1 cycle   */
#define LL_CORDIC_PRECISION_2_CYCLE  ((uint32_t)(CORDIC_CSR_PRECISION_1))                            /*!< 2 cycles  */
#define LL_CORDIC_PRECISION_3_CYCLE  ((uint32_t)(CORDIC_CSR_PRECISION_1 | CORDIC_CSR_PRECISION_0))   /*!< 3 cycles  */
#define LL_CORDIC_PRECISION_4_CYCLE  ((uint32_t)(CORDIC_CSR_PRECISION_2))                            /*!< 4 cycles  */
#define LL_CORDIC_PRECISION_5_CYCLE  ((uint32_t)(CORDIC_CSR_PRECISION_2 | CORDIC_CSR_PRECISION_0))   /*!< 5 cycles  */
#define LL_CORDIC_PRECISION_6_CYCLE  ((uint32_t)(CORDIC_CSR_PRECISION_2 | CORDIC_CSR_PRECISION_1))   /*!< 6 cycles  */
#define LL_CORDIC_PRECISION_7_CYCLE  ((uint32_t)(CORDIC_CSR_PRECISION_2 \
                                                 | CORDIC_CSR_PRECISION_1 | CORDIC_CSR_PRECISION_0)) /*!< 7 cycles  */
#define LL_CORDIC_PRECISION_8_CYCLE  ((uint32_t)(CORDIC_CSR_PRECISION_3))                            /*!< 8 cycles  */
#define LL_CORDIC_PRECISION_9_CYCLE  ((uint32_t)(CORDIC_CSR_PRECISION_3 | CORDIC_CSR_PRECISION_0))   /*!< 9 cycles  */
#define LL_CORDIC_PRECISION_10_CYCLE ((uint32_t)(CORDIC_CSR_PRECISION_3 | CORDIC_CSR_PRECISION_1))   /*!< 10 cycles */
#define LL_CORDIC_PRECISION_11_CYCLE ((uint32_t)(CORDIC_CSR_PRECISION_3 \
                                                 | CORDIC_CSR_PRECISION_1 | CORDIC_CSR_PRECISION_0)) /*!< 11 cycles */
#define LL_CORDIC_PRECISION_12_CYCLE ((uint32_t)(CORDIC_CSR_PRECISION_3 | CORDIC_CSR_PRECISION_2))   /*!< 12 cycles */
#define LL_CORDIC_PRECISION_13_CYCLE ((uint32_t)(CORDIC_CSR_PRECISION_3 \
                                                 | CORDIC_CSR_PRECISION_2 | CORDIC_CSR_PRECISION_0)) /*!< 13 cycles */
#define LL_CORDIC_PRECISION_14_CYCLE ((uint32_t)(CORDIC_CSR_PRECISION_3 \
                                                 | CORDIC_CSR_PRECISION_2 | CORDIC_CSR_PRECISION_1)) /*!< 14 cycles */
#define LL_CORDIC_PRECISION_15_CYCLE ((uint32_t)(CORDIC_CSR_PRECISION_3 \
                                                 | CORDIC_CSR_PRECISION_2 | CORDIC_CSR_PRECISION_1 \
                                                 | CORDIC_CSR_PRECISION_0))                          /*!< 15 cycles */
/**
  * @}
  */

/** @defgroup CORDIC_LL_EC_SCALE SCALE
  * @{
  */
#define LL_CORDIC_SCALING_FACTOR_0 (0x00000000U)                      /*!< Scaling factor - Arguments * 2^0 */
#define LL_CORDIC_SCALING_FACTOR_1 ((uint32_t)(CORDIC_CSR_SCALE_0))   /*!< Scaling factor - Arguments * 2^1 */
#define LL_CORDIC_SCALING_FACTOR_2 ((uint32_t)(CORDIC_CSR_SCALE_1))   /*!< Scaling factor - Arguments * 2^2 */
#define LL_CORDIC_SCALING_FACTOR_3 ((uint32_t)(CORDIC_CSR_SCALE_1 \
                                               | CORDIC_CSR_SCALE_0)) /*!< Scaling factor - Arguments * 2^3 */
#define LL_CORDIC_SCALING_FACTOR_4 ((uint32_t)(CORDIC_CSR_SCALE_2))   /*!< Scaling factor - Arguments * 2^4 */
#define LL_CORDIC_SCALING_FACTOR_5 ((uint32_t)(CORDIC_CSR_SCALE_2 \
                                               | CORDIC_CSR_SCALE_0)) /*!< Scaling factor - Arguments * 2^5 */
#define LL_CORDIC_SCALING_FACTOR_6 ((uint32_t)(CORDIC_CSR_SCALE_2 \
                                               | CORDIC_CSR_SCALE_1)) /*!< Scaling factor - Arguments * 2^6 */
#define LL_CORDIC_SCALING_FACTOR_7 ((uint32_t)(CORDIC_CSR_SCALE_2 | CORDIC_CSR_SCALE_1 \
                                               | CORDIC_CSR_SCALE_0)) /*!< Scaling factor - Arguments * 2^7 */
/**
  * @}
  */

